AaronKao24/HKMC_CAN2UART/dev_fw/dev_h/nRF52840_pin_def.h
#ifndef _NRF52840_PIN_DEFINE_
#define _NRF52840_PIN_DEFINE_
#define PIN_PID_A		28

#define PIN_CAN_SPI_CS		26
#define PIN_CAN_SPI_MOSI	27
#define PIN_CAN_SPI_MISO	4
#define PIN_CAN_SPI_SCK		5
#define PIN_CAN_STBY		13
#define PIN_CAN_INT_1		14
#define PIN_CAN_INT_0		15

#define PIN_LCM_SPI_CS_N	6 
#define PIN_LCM_SPI_SDA		8
#define PIN_LCM_SPI_WRX		7
#define PIN_LCM_SPI_SCK		40 // (32+8)
#define PIN_LCM_CRT			39 // (32+7)
#define PIN_LCM_RESET_N		37 // (32+5)

#define PIN_MF_SPI_CS_N		17
#define PIN_MF_SPI_SCLK		19 
#define PIN_MF_SPI_SIO0		21
#define PIN_MF_SPI_SIO1		22
#define PIN_MF_SPI_SIO2		23
#define PIN_MF_SPI_SIO3		32 
 

#define PIN_VBUS_5V_DET		30
#define PIN_CC1_DET			2
#define PIN_CC2_DET			3


#define PIN_USB_PRSW_EN		36



#define PIN_PWR_MODE_H		47
#define PIN_PWR_MODE_L		45
#define MCU_FUNCTION		43
#define MCU_LIGHT_CRT		42
#define PIN_PWR_KEY_DET		33

#define PIN_DBG_UART_TX		25
#define PIN_DBG_UART_RX		24

#define PIN_USB_CTL1		16
#define PIN_USB_CTL3		20


#endif
